org/Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006
#+TITLE: Pattern recognition and machine learning by Chris Bishop in 2006
* "__This is the first textbook on pattern recognition to present the Bayesian viewpoint. The book presents approximate inference algorithms that permit fast approximate answers in situations where exact answers are not feasible. It uses graphical models to describe probability distributions when no other books apply graphical models to machine learning.__ — via [[https://www.amazon.com/Pattern-Recognition-Learning-Information-Statistics/dp/0387310738/][Pattern Recognition and Machine Learning (Information Science and Statistics): Bishop, Christopher M.: 9780387310732: Amazon.com: Books]] brought back to my attention via https://bloomberg.github.io/foml/#lectures "
* "Found another source pointing to [[https://discourse.pymc.io/t/machine-learning-textbook-with-a-bayesian-perceptive/68][[file:Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006.org][Pattern recognition and machine learning by Chris Bishop in 2006]] on the [pymc3 discourse]]"
* [[file:books.org][books]], [[file:probabilistic_inference.org][probabilistic inference]]
* 1. Introduction
** 1.1 Example polynomial curve fitting
*** maximum likelihood
*** shrinkage methods
**** [[https://en.wikipedia.org/wiki/Tikhonov_regularization) / ridge regression (Hoerl and Kennard, 1970][Tikhonov regularization]] and weight decay
***** $$\tilde{E}(w) = \frac{1}{2} \sum_{n=1}^{N} \{ y(x_n, \mathbf{w}) * t_n \}^2 + \frac{\lambda}{2} || \mathbf{w} ||^2$$
** 1.2 Probability theory
*** 1.2.1 Probability densities
*** 1.2.2 Expectations and covariances
*** 1.2.3 Bayesian probabilities
**** Consider an uncertain event, for example whether the moon was once in its own orbit around the sun, or whether the Arctic ice cap will have disappeared by the end of the century. These are not events that can be repeated numerous times in order to define a notion of probability as we did earlier in the context of boxes of fruit. Nevertheless, we will generally have some idea, for example, of how quickly we think the polar ice is melting.
**** we would like to be able to quantify our expression of uncertainty and make precise revisions of uncertainty in the light of new evidence, as well as subsequently to be able to take optimal actions or decisions as a consequence
**** candidate axiomatizations of probability
***** Ramsey, F. (1931). Truth and probability. In R. Braithwaite (Ed.), The Foundations of Mathematics and other Logical Essays. Humanities Press.
***** Cox, R. T. (1946). Probability, frequency and reasonable expectation. American Journal of Physics 14(1), 1–13.
***** Good, I. (1950). Probability and the Weighing of Evidence. Hafners.
***** Savage, L. J. (1961). The subjective basis of statistical practice. Technical report, Department of Statistics, University of Michigan, Ann Arbor.
***** deFinetti, B. (1970). Theory of Probability. Wiley and Sons.
***** Lindley, D. V. (1982). Scoring rules and the inevitability of probability. International Statistical Review 50, 1–26.
***** Jaynes, E. T. (2003). Probability Theory: The Logic of Science. Cambridge University Press.
*** 1.2.4 The Gaussian distribution
*** 1.2.5 Curve fitting re-visited
*** 1.2.6 Bayesian curve fitting [[file:key_subsection.org][key subsection]]
**** Look for reference with code / derivation of the analytical form given in equations 1.69-1.72 
** 1.3 Model selection [[file:progress_indicators.org][progress indicators]]
** 1.4 The curse of dimensionality
** 1.5 Decision theory
*** 1.5.1 Minimizing the misclassification rate
*** 1.5.2 Minimizing the expected loss
*** 1.5.3 The reject option
*** 1.5.4 Inference and decision
**** Cross-references
***** "4.2 Probabilistic generative models (for classification) [[file:key_subsection.org][key subsection]]"
**** 
*** 1.5.5 Loss functions for regression
** 1.6 Information theory
*** 1.6.1 Relative entropy and mutual information
* 2. Probability distributions
** 2.1 Binary variables
*** 2.1.1 The beta distribution
** 2.2 Multinomial variables
*** 2.2.1 The Dirichlet distribution
** 2.3 The Gausssian distribution
*** 2.3.1 Conditional Gaussian distributions
*** 2.3.2 Marginal Gaussian distributions
*** 2.3.3 Bayes' theorem for Gaussian variables
*** 2.3.4 Maximum likelihood for the Gaussian
*** 2.3.5 Sequential estimation
*** 2.3.6 Bayesian inference for the Gaussian
*** 2.3.7 Student's t-distribution
*** 2.3.8 Periodic variables
*** 2.3.9 Mixtures of Gaussians
** 2.4 The exponential family
*** 2.4.1 Maximum likelihood and sufficient statistics
*** 2.4.2 Conjugate priors
*** 2.4.3 Noninformative priors
** 2.5 Nonparametric methods
*** 2.5.1 Kernel density estimators
*** 2.5.2 Nearest-neighbor methods
* 3. Linear models for regression
** 3.1 Linear basis function models
*** 3.1.1 Maximum likelihood and least squares
*** 3.1.2 Geometry of least squares
*** 3.1.3 Sequential learning
*** 3.1.4 Regularized least squares
*** 3.1.5 Multiple outputs
** 3.2 The bias-variance decomposition
** 3.3 Bayesian linear regression [[file:key_subsection.org][key subsection]]
*** 3.3.1 Parameter distribution
*** 3.3.2 Predictive distribution
*** 3.3.3 Equivalent kernel
** 3.4 Bayesian model comparison
** 3.5 The evidence approximation
*** 3.5.1 Evaluation of the evidence function
*** 3.5.2 Maximizing the evidence function
*** 3.5.3 Effective number of parameters
** 3.6 Limitations of fixed basis functions
* 4. Linear models for classification
** 4.1 Discriminant functions
*** 4.1.1 Two classes
*** 4.1.2 Multiple classes
*** 4.1.3 Least squares for classification
*** 4.1.4 Fisher's linear discriminant
*** 4.1.5 Relation to least squares
*** 4.1.6 Fisher's discriminant for multiple classes
*** 4.1.7 The perceptron algorithm
** 4.2 Probabilistic generative models (for classification) [[file:key_subsection.org][key subsection]]
*** 4.2.0 Introduction
