content/posts/Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006.md
+++
title = "Pattern recognition and machine learning by Chris Bishop in 2006"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:34-04:00
slug = "Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006"
draft = false
+++

## "<span class="underline"><span class="underline">This is the first textbook on pattern recognition to present the Bayesian viewpoint. The book presents approximate inference algorithms that permit fast approximate answers in situations where exact answers are not feasible. It uses graphical models to describe probability distributions when no other books apply graphical models to machine learning.</span></span> — via [Pattern Recognition and Machine Learning (Information Science and Statistics): Bishop, Christopher M.: 9780387310732: Amazon.com: Books](<https://www.amazon.com/Pattern-Recognition-Learning-Information-Statistics/dp/0387310738/>) brought back to my attention via <https://bloomberg.github.io/foml/#lectures> " {#via-pattern-recognition-and-machine-learning--information-science-and-statistics--bishop-christopher-m-dot-9780387310732-amazon-dot-com-books--https-www-dot-amazon-dot-com-pattern-recognition-learning-information-statistics-dp-0387310738--brought-back-to-my-attention-via-https-bloomberg-dot-github-dot-io-foml-lectures}


## "Found another source pointing to [Pattern recognition and machine learning by Chris Bishop in 2006]({{< relref "Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006" >}}) on the [pymc3 discourse](<https://discourse.pymc.io/t/machine-learning-textbook-with-a-bayesian-perceptive/68>)" {#found-another-source-pointing-to-pattern-recognition-and-machine-learning-by-chris-bishop-in-2006--pattern-recognition-and-machine-learning-by-chris-bishop-in-2006-dot-md--on-the-pymc3-discourse--https-discourse-dot-pymc-dot-io-t-machine-learning-textbook-with-a-bayesian-perceptive-68}


## [books]({{< relref "books" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}) {#books--books-dot-md--probabilistic-inference--probabilistic-inference-dot-md}


## 1. Introduction {#1-dot-introduction}


### 1.1 Example polynomial curve fitting {#1-dot-1-example-polynomial-curve-fitting}

<!--list-separator-->

-  maximum likelihood

<!--list-separator-->

-  shrinkage methods

    <!--list-separator-->

    -  [Tikhonov regularization](<https://en.wikipedia.org/wiki/Tikhonov%5Fregularization>) / ridge regression (Hoerl and Kennard, 1970) and weight decay

        <!--list-separator-->

        -  \\[\tilde{E}(w) = \frac{1}{2} \sum\_{n=1}^{N} \\{ y(x\_n, \mathbf{w}) \* t\_n \\}^2 + \frac{\lambda}{2} || \mathbf{w} ||^2\\]


### 1.2 Probability theory {#1-dot-2-probability-theory}

<!--list-separator-->

-  1.2.1 Probability densities

<!--list-separator-->

-  1.2.2 Expectations and covariances

<!--list-separator-->

-  1.2.3 Bayesian probabilities

    <!--list-separator-->

    -  Consider an uncertain event, for example whether the moon was once in its own orbit around the sun, or whether the Arctic ice cap will have disappeared by the end of the century. These are not events that can be repeated numerous times in order to define a notion of probability as we did earlier in the context of boxes of fruit. Nevertheless, we will generally have some idea, for example, of how quickly we think the polar ice is melting.

    <!--list-separator-->

    -  we would like to be able to quantify our expression of uncertainty and make precise revisions of uncertainty in the light of new evidence, as well as subsequently to be able to take optimal actions or decisions as a consequence

    <!--list-separator-->

    -  candidate axiomatizations of probability

        <!--list-separator-->

        -  Ramsey, F. (1931). Truth and probability. In R. Braithwaite (Ed.), The Foundations of Mathematics and other Logical Essays. Humanities Press.

        <!--list-separator-->

        -  Cox, R. T. (1946). Probability, frequency and reasonable expectation. American Journal of Physics 14(1), 1–13.

        <!--list-separator-->

        -  Good, I. (1950). Probability and the Weighing of Evidence. Hafners.

        <!--list-separator-->

        -  Savage, L. J. (1961). The subjective basis of statistical practice. Technical report, Department of Statistics, University of Michigan, Ann Arbor.

        <!--list-separator-->

        -  deFinetti, B. (1970). Theory of Probability. Wiley and Sons.

        <!--list-separator-->

        -  Lindley, D. V. (1982). Scoring rules and the inevitability of probability. International Statistical Review 50, 1–26.

        <!--list-separator-->

        -  Jaynes, E. T. (2003). Probability Theory: The Logic of Science. Cambridge University Press.

<!--list-separator-->

-  1.2.4 The Gaussian distribution

<!--list-separator-->

-  1.2.5 Curve fitting re-visited

<!--list-separator-->

-  1.2.6 Bayesian curve fitting [key subsection]({{< relref "key_subsection" >}})

    <!--list-separator-->

    -  Look for reference with code / derivation of the analytical form given in equations 1.69-1.72


### 1.3 Model selection [progress indicators]({{< relref "progress_indicators" >}}) {#1-dot-3-model-selection-progress-indicators--progress-indicators-dot-md}


### 1.4 The curse of dimensionality {#1-dot-4-the-curse-of-dimensionality}


### 1.5 Decision theory {#1-dot-5-decision-theory}

<!--list-separator-->

-  1.5.1 Minimizing the misclassification rate

<!--list-separator-->

-  1.5.2 Minimizing the expected loss

<!--list-separator-->

-  1.5.3 The reject option

<!--list-separator-->

-  1.5.4 Inference and decision

    <!--list-separator-->

    -  Cross-references

        <!--list-separator-->

        -  "4.2 Probabilistic generative models (for classification) [key subsection]({{< relref "key_subsection" >}})"

    <!--list-separator-->

    -

<!--list-separator-->

-  1.5.5 Loss functions for regression


### 1.6 Information theory {#1-dot-6-information-theory}

<!--list-separator-->

-  1.6.1 Relative entropy and mutual information


## 2. Probability distributions {#2-dot-probability-distributions}


### 2.1 Binary variables {#2-dot-1-binary-variables}

<!--list-separator-->

-  2.1.1 The beta distribution


### 2.2 Multinomial variables {#2-dot-2-multinomial-variables}

<!--list-separator-->

-  2.2.1 The Dirichlet distribution


### 2.3 The Gausssian distribution {#2-dot-3-the-gausssian-distribution}

<!--list-separator-->

-  2.3.1 Conditional Gaussian distributions

<!--list-separator-->

-  2.3.2 Marginal Gaussian distributions

<!--list-separator-->

-  2.3.3 Bayes' theorem for Gaussian variables

<!--list-separator-->

-  2.3.4 Maximum likelihood for the Gaussian

<!--list-separator-->

-  2.3.5 Sequential estimation

<!--list-separator-->

-  2.3.6 Bayesian inference for the Gaussian

<!--list-separator-->

-  2.3.7 Student's t-distribution

<!--list-separator-->

-  2.3.8 Periodic variables

<!--list-separator-->

-  2.3.9 Mixtures of Gaussians


### 2.4 The exponential family {#2-dot-4-the-exponential-family}

<!--list-separator-->

-  2.4.1 Maximum likelihood and sufficient statistics

<!--list-separator-->

-  2.4.2 Conjugate priors

<!--list-separator-->

-  2.4.3 Noninformative priors


### 2.5 Nonparametric methods {#2-dot-5-nonparametric-methods}

<!--list-separator-->

-  2.5.1 Kernel density estimators

<!--list-separator-->

-  2.5.2 Nearest-neighbor methods


## 3. Linear models for regression {#3-dot-linear-models-for-regression}


### 3.1 Linear basis function models {#3-dot-1-linear-basis-function-models}

<!--list-separator-->

-  3.1.1 Maximum likelihood and least squares

<!--list-separator-->

-  3.1.2 Geometry of least squares

<!--list-separator-->

-  3.1.3 Sequential learning

<!--list-separator-->

-  3.1.4 Regularized least squares

<!--list-separator-->

-  3.1.5 Multiple outputs


### 3.2 The bias-variance decomposition {#3-dot-2-the-bias-variance-decomposition}


### 3.3 Bayesian linear regression [key subsection]({{< relref "key_subsection" >}}) {#3-dot-3-bayesian-linear-regression-key-subsection--key-subsection-dot-md}

<!--list-separator-->

-  3.3.1 Parameter distribution

<!--list-separator-->

-  3.3.2 Predictive distribution

<!--list-separator-->

-  3.3.3 Equivalent kernel


### 3.4 Bayesian model comparison {#3-dot-4-bayesian-model-comparison}


### 3.5 The evidence approximation {#3-dot-5-the-evidence-approximation}

<!--list-separator-->

-  3.5.1 Evaluation of the evidence function

<!--list-separator-->

-  3.5.2 Maximizing the evidence function

<!--list-separator-->

-  3.5.3 Effective number of parameters


### 3.6 Limitations of fixed basis functions {#3-dot-6-limitations-of-fixed-basis-functions}


## 4. Linear models for classification {#4-dot-linear-models-for-classification}


### 4.1 Discriminant functions {#4-dot-1-discriminant-functions}

<!--list-separator-->

-  4.1.1 Two classes

<!--list-separator-->

-  4.1.2 Multiple classes

<!--list-separator-->

-  4.1.3 Least squares for classification

<!--list-separator-->

-  4.1.4 Fisher's linear discriminant

<!--list-separator-->

-  4.1.5 Relation to least squares

<!--list-separator-->

-  4.1.6 Fisher's discriminant for multiple classes

<!--list-separator-->

-  4.1.7 The perceptron algorithm


### 4.2 Probabilistic generative models (for classification) [key subsection]({{< relref "key_subsection" >}}) {#4-dot-2-probabilistic-generative-models--for-classification--key-subsection--key-subsection-dot-md}

<!--list-separator-->

-  4.2.0 Introduction

    <!--list-separator-->
