org/Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006.org
**** We turn next to a **probabilistic view of classification** and show how **models with linear decision boundaries** arise from **simple assumptions about the distribution of the data**.
**** The class-conditional densities $$p(\mathbf{x} \vert \mathcal{C}_k)$$ and class priors $$p(\mathcal{C}_k)$$ can be used to compute the class posteriors $$p(\mathcal{C}_k \vert x)$$.
**** In general, the posterior distribution takes the form of a [[file:normalized_exponential_function.org][normalized exponential function]], which is a multiclass generalization of the [[file:logistic_sigmoid_function.org][logistic sigmoid function]].
***** $$p(\mathcal{C}_k \vert x) = \frac{\exp(a_k)}{\Sigma_j \exp(a_j)}$$
***** where $$a_k = \ln p(\mathbf{x} \vert \mathcal{C}_k) p(\mathcal{C}_k)$$
*** 4.2.1 Continuous inputs
**** Let us assume that the class-conditional densities are Gaussian and then explore the resulting form for the posterior probabilities.
*** 4.2.2 Maximum likelihood solution
*** 4.2.3 Discrete features
*** 4.2.4 Exponential family
** 4.3 Probabilistic discriminative models
*** 4.3.1 Fixed basis functions
*** 4.3.2 Logistic regression
*** 4.3.3 Iteratively reweighted least squares
*** 4.3.4 Multiclass logistic regression
*** 4.3.5 Probit regression
*** 4.3.6 Canonical link functions
** 4.4 The Laplace approximation [[file:key_subsection.org][key subsection]]
*** 4.4.0 Introduction
*** 4.4.1 Model comparison and BIC
** 4.5 Bayesian logistic regression [[file:key_subsection.org][key subsection]]
*** 4.5.0 Introduction
**** Exact Bayesian inference for logistic regression is intractable. 
**** Here we consider the application of the Laplace approximation to the problem of Bayesian logistic regression 
***** Spiegelhalter and Lauritzen, 1990; 
****** Spiegelhalter, D. and S. Lauritzen (1990). Sequential updating of conditional probabilities on directed graphical structures. Networks 20, 579–605.
***** MacKay, 1992b
****** MacKay, D. J. C. (1992b). The evidence framework applied to classification networks. Neural Computation 4(5), 720–736.
*** 4.5.1 Laplace approximation
*** 4.5.2 Predictive distribution
*** 
* 5. Neural networks
** 5.1 Feed-forward network functions
*** 5.1.1 Weight-space symmetries
** 5.2 Network training
*** 5.2.1 Parameter optimization
*** 5.2.2 Local quadratic approximation
*** 5.2.3 Use of gradient information
*** 5.2.4 Gradient descent optimization
** 5.3 Error backpropagation
*** 5.3.1 Evaluation of error-function derivatives
*** 5.3.2 A simple example
*** 5.3.3 Efficiency of backpropagation
*** 5.3.4 The Jacobian matrix
** 5.4 The Hessian matrix
*** 5.4.1 Diagonal approximation
*** 5.4.2 Outer product approximation
*** 5.4.3 Inverse Hessian
*** 5.4.4 Finite differences
*** 5.4.5 Exact evaluation of the Hessian
*** 5.4.6 Fast multiplication by the Hessian
** 5.5 Regularization in neural networks
*** 5.5.1 Consistent Gaussian priors
*** 5.5.2 Early stopping
*** 5.5.3 Invariances
*** 5.5.4 Tangent propagation
*** 5.5.5 Training with transformed data
*** 5.5.6 Convolutional networks
*** 5.5.7 Soft weight sharing
** 5.6 Mixture density networks
** 5.7 Bayesian neural networks
*** 5.7.1 Posterior parameter distribution
*** 5.7.2 Hyperparameter optimization
*** 5.7.3 Bayesian neural networks for classification
* 6. Kernel methods
** 6.0 Introduction
** 6.1 Dual representations
** 6.2 Constructing kernels
** 6.3 Radial basis function networks
*** 6.3.1 Nadaraya-Watson model
** 6.4 Gaussian processes [[file:key_subsection.org][key subsection]]
*** 6.4.1 Linear regression revisited
*** 6.4.2 Gaussian processes for regression
*** 6.4.3 Learning the hyperparameters
*** 6.4.4 Automatic relevance determination
*** 6.4.5 Gaussian processes for classification
*** 6.4.6 Laplace approximation
*** 6.4.7 Connection to neural networks
**** In a Bayesian neural network, the prior distribution over the parameter vector w, in conjunction with the network function f(x,w), produces a prior distribution over functions from y(x) where y is the vector of network outputs. Neal (1996) has shown that, for a broad class of prior distributions over w, the distribution of functions generated by a neural network will tend to a Gaussian process in the limit M →∞. It should be noted, however, that in this limit the output variables of the neural network become independent. One of the great merits of neural networks is that the outputs share the hidden units and so they can ‘borrow statistical strength’ from each other, that is, the weights associated with each hidden unit are influenced by all of the output variables not just by one of them. This property is therefore lost in the Gaussian process limit.
* 7. Sparse kernel machines
** 7.1 Maximum margin classifiers
*** 7.1.1 Overlapping class distributions
*** 7.1.2 Relation to logistic regression
*** 7.1.3 Multiclass SVMs
*** 7.1.4 SVMs for regression
*** 7.1.5 Computational learning theory
** 7.2 Relevance vector machines
*** 7.2.1 RVM for regression
*** 7.2.2 Analysis of sparsity
*** 7.2.3 RVM for classification
* 8. Graphical models
** 8.1 Bayesian networks
*** 8.1.1 Example: polynomial regression
*** 8.1.2 Generative models
*** 8.1.3 Discrete variables
*** 8.1.4 Linear-Gaussian models
** 8.2 Conditional independence
*** 8.2.1 Three example graphs
*** 8.2.2 D-separation
** 8.3 Markov random fields
*** 8.3.1 Conditional independence properties
*** 8.3.2 Factorization properties
*** 8.3.3 Illustration: Image de-noising
*** 8.3.4 Relation to directed graphs
** 8.4 Inference in graphical models
*** 8.4.1 Inference on a chain
*** 8.4.2 Trees
*** 8.4.3 Factor graphs
*** 8.4.4 The sum-product algorithm
*** 8.4.5 The max-sum algorithm
*** 8.4.6 Exact inference in general graphs
*** 8.4.7 Loopy belief propagation
*** 8.4.8 Learning the graph structure
* 9. Mixture models and expectation maximization (EM)
** 9.1 K-means clustering
*** 9.1.1 Image segmentation and compression
** 9.2 Mixtures of Gaussians
*** 9.2.1 Maximum likelihood
*** 9.2.2 EM for Gaussian mixtures
** 9.3 An alternative view of EM
*** 9.3.1 Gaussian mixtures revisited
*** 9.3.2 Relation to K-means
*** 9.3.3 Mixtures of Bernoulli distributions
*** 9.3.4 EM for Bayesian linear regression
