content/posts/Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006.md

    -  We turn next to a ****probabilistic view of classification**** and show how ****models with linear decision boundaries**** arise from ****simple assumptions about the distribution of the data****.

    <!--list-separator-->

    -  The class-conditional densities \\[p(\mathbf{x} \vert \mathcal{C}\_k)\\] and class priors \\[p(\mathcal{C}\_k)\\] can be used to compute the class posteriors \\[p(\mathcal{C}\_k \vert x)\\].

    <!--list-separator-->

    -  In general, the posterior distribution takes the form of a [normalized exponential function]({{< relref "normalized_exponential_function" >}}), which is a multiclass generalization of the [logistic sigmoid function]({{< relref "logistic_sigmoid_function" >}}).

        <!--list-separator-->

        -  \\[p(\mathcal{C}\_k \vert x) = \frac{\exp(a\_k)}{\Sigma\_j \exp(a\_j)}\\]

        <!--list-separator-->

        -  where \\[a\_k = \ln p(\mathbf{x} \vert \mathcal{C}\_k) p(\mathcal{C}\_k)\\]

<!--list-separator-->

-  4.2.1 Continuous inputs

    <!--list-separator-->

    -  Let us assume that the class-conditional densities are Gaussian and then explore the resulting form for the posterior probabilities.

<!--list-separator-->

-  4.2.2 Maximum likelihood solution

<!--list-separator-->

-  4.2.3 Discrete features

<!--list-separator-->

-  4.2.4 Exponential family


### 4.3 Probabilistic discriminative models {#4-dot-3-probabilistic-discriminative-models}

<!--list-separator-->

-  4.3.1 Fixed basis functions

<!--list-separator-->

-  4.3.2 Logistic regression

<!--list-separator-->

-  4.3.3 Iteratively reweighted least squares

<!--list-separator-->

-  4.3.4 Multiclass logistic regression

<!--list-separator-->

-  4.3.5 Probit regression

<!--list-separator-->

-  4.3.6 Canonical link functions


### 4.4 The Laplace approximation [key subsection]({{< relref "key_subsection" >}}) {#4-dot-4-the-laplace-approximation-key-subsection--key-subsection-dot-md}

<!--list-separator-->

-  4.4.0 Introduction

<!--list-separator-->

-  4.4.1 Model comparison and BIC


### 4.5 Bayesian logistic regression [key subsection]({{< relref "key_subsection" >}}) {#4-dot-5-bayesian-logistic-regression-key-subsection--key-subsection-dot-md}

<!--list-separator-->

-  4.5.0 Introduction

    <!--list-separator-->

    -  Exact Bayesian inference for logistic regression is intractable.

    <!--list-separator-->

    -  Here we consider the application of the Laplace approximation to the problem of Bayesian logistic regression

        <!--list-separator-->

        -  Spiegelhalter and Lauritzen, 1990;

            <!--list-separator-->

            -  Spiegelhalter, D. and S. Lauritzen (1990). Sequential updating of conditional probabilities on directed graphical structures. Networks 20, 579–605.

        <!--list-separator-->

        -  MacKay, 1992b

            <!--list-separator-->

            -  MacKay, D. J. C. (1992b). The evidence framework applied to classification networks. Neural Computation 4(5), 720–736.

<!--list-separator-->

-  4.5.1 Laplace approximation

<!--list-separator-->

-  4.5.2 Predictive distribution

<!--list-separator-->

-


## 5. Neural networks {#5-dot-neural-networks}


### 5.1 Feed-forward network functions {#5-dot-1-feed-forward-network-functions}

<!--list-separator-->

-  5.1.1 Weight-space symmetries


### 5.2 Network training {#5-dot-2-network-training}

<!--list-separator-->

-  5.2.1 Parameter optimization

<!--list-separator-->

-  5.2.2 Local quadratic approximation

<!--list-separator-->

-  5.2.3 Use of gradient information

<!--list-separator-->

-  5.2.4 Gradient descent optimization


### 5.3 Error backpropagation {#5-dot-3-error-backpropagation}

<!--list-separator-->

-  5.3.1 Evaluation of error-function derivatives

<!--list-separator-->

-  5.3.2 A simple example

<!--list-separator-->

-  5.3.3 Efficiency of backpropagation

<!--list-separator-->

-  5.3.4 The Jacobian matrix


### 5.4 The Hessian matrix {#5-dot-4-the-hessian-matrix}

<!--list-separator-->

-  5.4.1 Diagonal approximation

<!--list-separator-->

-  5.4.2 Outer product approximation

<!--list-separator-->

-  5.4.3 Inverse Hessian

<!--list-separator-->

-  5.4.4 Finite differences

<!--list-separator-->

-  5.4.5 Exact evaluation of the Hessian

<!--list-separator-->

-  5.4.6 Fast multiplication by the Hessian


### 5.5 Regularization in neural networks {#5-dot-5-regularization-in-neural-networks}

<!--list-separator-->

-  5.5.1 Consistent Gaussian priors

<!--list-separator-->

-  5.5.2 Early stopping

<!--list-separator-->

-  5.5.3 Invariances

<!--list-separator-->

-  5.5.4 Tangent propagation

<!--list-separator-->

-  5.5.5 Training with transformed data

<!--list-separator-->

-  5.5.6 Convolutional networks

<!--list-separator-->

-  5.5.7 Soft weight sharing


### 5.6 Mixture density networks {#5-dot-6-mixture-density-networks}


### 5.7 Bayesian neural networks {#5-dot-7-bayesian-neural-networks}

<!--list-separator-->

-  5.7.1 Posterior parameter distribution

<!--list-separator-->

-  5.7.2 Hyperparameter optimization

<!--list-separator-->

-  5.7.3 Bayesian neural networks for classification


## 6. Kernel methods {#6-dot-kernel-methods}


### 6.0 Introduction {#6-dot-0-introduction}


### 6.1 Dual representations {#6-dot-1-dual-representations}


### 6.2 Constructing kernels {#6-dot-2-constructing-kernels}


### 6.3 Radial basis function networks {#6-dot-3-radial-basis-function-networks}

<!--list-separator-->

-  6.3.1 Nadaraya-Watson model


### 6.4 Gaussian processes [key subsection]({{< relref "key_subsection" >}}) {#6-dot-4-gaussian-processes-key-subsection--key-subsection-dot-md}

<!--list-separator-->

-  6.4.1 Linear regression revisited

<!--list-separator-->

-  6.4.2 Gaussian processes for regression

<!--list-separator-->

-  6.4.3 Learning the hyperparameters

<!--list-separator-->

-  6.4.4 Automatic relevance determination

<!--list-separator-->

-  6.4.5 Gaussian processes for classification

<!--list-separator-->

-  6.4.6 Laplace approximation

<!--list-separator-->

-  6.4.7 Connection to neural networks

    <!--list-separator-->

    -  In a Bayesian neural network, the prior distribution over the parameter vector w, in conjunction with the network function f(x,w), produces a prior distribution over functions from y(x) where y is the vector of network outputs. Neal (1996) has shown that, for a broad class of prior distributions over w, the distribution of functions generated by a neural network will tend to a Gaussian process in the limit M →∞. It should be noted, however, that in this limit the output variables of the neural network become independent. One of the great merits of neural networks is that the outputs share the hidden units and so they can ‘borrow statistical strength’ from each other, that is, the weights associated with each hidden unit are influenced by all of the output variables not just by one of them. This property is therefore lost in the Gaussian process limit.


## 7. Sparse kernel machines {#7-dot-sparse-kernel-machines}


### 7.1 Maximum margin classifiers {#7-dot-1-maximum-margin-classifiers}

<!--list-separator-->

-  7.1.1 Overlapping class distributions

<!--list-separator-->

-  7.1.2 Relation to logistic regression

<!--list-separator-->

-  7.1.3 Multiclass SVMs

<!--list-separator-->

-  7.1.4 SVMs for regression

<!--list-separator-->

-  7.1.5 Computational learning theory


### 7.2 Relevance vector machines {#7-dot-2-relevance-vector-machines}

<!--list-separator-->

-  7.2.1 RVM for regression

<!--list-separator-->

-  7.2.2 Analysis of sparsity

<!--list-separator-->

-  7.2.3 RVM for classification


## 8. Graphical models {#8-dot-graphical-models}


### 8.1 Bayesian networks {#8-dot-1-bayesian-networks}

<!--list-separator-->

-  8.1.1 Example: polynomial regression

<!--list-separator-->

-  8.1.2 Generative models

<!--list-separator-->

-  8.1.3 Discrete variables

<!--list-separator-->

-  8.1.4 Linear-Gaussian models


### 8.2 Conditional independence {#8-dot-2-conditional-independence}

<!--list-separator-->

-  8.2.1 Three example graphs

<!--list-separator-->

-  8.2.2 D-separation


### 8.3 Markov random fields {#8-dot-3-markov-random-fields}

<!--list-separator-->

-  8.3.1 Conditional independence properties

<!--list-separator-->

-  8.3.2 Factorization properties

<!--list-separator-->

-  8.3.3 Illustration: Image de-noising

<!--list-separator-->

-  8.3.4 Relation to directed graphs


### 8.4 Inference in graphical models {#8-dot-4-inference-in-graphical-models}

<!--list-separator-->

-  8.4.1 Inference on a chain

<!--list-separator-->

-  8.4.2 Trees

<!--list-separator-->

-  8.4.3 Factor graphs

<!--list-separator-->

-  8.4.4 The sum-product algorithm

<!--list-separator-->

-  8.4.5 The max-sum algorithm

<!--list-separator-->

-  8.4.6 Exact inference in general graphs

<!--list-separator-->

-  8.4.7 Loopy belief propagation

<!--list-separator-->

-  8.4.8 Learning the graph structure


## 9. Mixture models and expectation maximization (EM) {#9-dot-mixture-models-and-expectation-maximization--em}


### 9.1 K-means clustering {#9-dot-1-k-means-clustering}

<!--list-separator-->

-  9.1.1 Image segmentation and compression


### 9.2 Mixtures of Gaussians {#9-dot-2-mixtures-of-gaussians}

<!--list-separator-->

-  9.2.1 Maximum likelihood

<!--list-separator-->

-  9.2.2 EM for Gaussian mixtures


### 9.3 An alternative view of EM {#9-dot-3-an-alternative-view-of-em}

<!--list-separator-->

-  9.3.1 Gaussian mixtures revisited

<!--list-separator-->

-  9.3.2 Relation to K-means

<!--list-separator-->

-  9.3.3 Mixtures of Bernoulli distributions

<!--list-separator-->

-  9.3.4 EM for Bayesian linear regression
