org/Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006.org
** 9.4 The EM algorithm in general
* 10. Approximate inference
** 10.1 Variational inference
*** 10.1.1 Factorized distributions
*** 10.1.2 Properties of factorized approximations
*** 10.1.3 Example: the univariate Gaussian
*** 10.1.4 Model comparison
** 10.2 Illustration: Variational mixture of Gaussians
*** 10.2.1 Variational distribution
*** 10.2.2 Variational lower bound
*** 10.2.3 Predictive density
*** 10.2.4 Determining the number of components
*** 10.2.5 Induced factorizations
** 10.3 Variational linear regression
*** 10.3.1 Variational distribution
*** 10.3.2 Predictive distribution
*** 10.3.3 Lower bound
** 10.4 Exponential family distributions
*** 10.4.0 Introduction
**** Up to now we have grouped the variables in the model into **observed variables** and **hidden variables**. We now make a further distinction between __latent variables__, denoted $$Z$$, and __parameters__, denoted $$\theta$$, where **parameters** are **intensive** ^^(fixed in number independent of the size of the data set)^^, whereas **latent variables** are **extensive** ^^(scale in number with the size of the data set)^^.
*** 10.4.1 Variational message passing
** 10.5 Local variational methods
** 10.6 Variational logistic regression
*** 10.6.1 Variational posterior distribution
*** 10.6.2 Optimizing the variational parameters
*** 10.6.3 Inference of hyperparameters
** 10.7 Expectation propagation
*** 10.7.1 Example: the clutter problem
*** 10.7.2 Expectation propagation on graphs
* 11. Sampling methods
** 11.1 Basic sampling algorithms
*** 11.1.1 Standard distributions
*** 11.1.2 Rejection sampling
*** 11.1.3 Adaptive rejection sampling
*** 11.1.4 Importance sampling
*** 11.1.5 Sampling-importance-resampling
*** 11.1.6 Sampling and the EM algorithm
** 11.2 Markov Chain Monte Carlo
*** 11.2.1 Markov chains
*** 11.2.2 The Metropolis-Hastings algorithm
** 11.3 Gibbs sampling
** 11.4 Slice sampling
** 11.5 The hybrid Monte Carlo algorithm
*** 11.5.1 Dynamical systems
*** 11.5.2 Hybrid Monte Carlo
** 11.6 Estimating the partition function
* 12. Continuous latent variables
** 12.1 Principal component analysis
*** 12.1.1 Maximum variance formulation
*** 12.1.2 Minimum-error formulation
*** 12.1.3 Applications of PCA
*** 12.1.4 PCA for high-dimensional data
** 12.2 Probabilistic PCA
*** 12.2.1 Maximum likelihood PCA
*** 12.2.2 EM algorithm for PCA
*** 12.2.3 Bayesian PCA
*** 12.2.4 Factor analysis
** 12.3 Kernel PCA
** 12.4 Nonlinear latent variable models
*** 12.4.1 Independent component analysis
*** 12.4.2 Autoassociative neural networks
*** 12.4.3 Modelling nonlinear manifolds
* 13. Sequential data
** 13.0 Introduction
*** Although such models are tractable, they are also severely limited. We can obtain a more general framework, while still retaining tractability, by the introduction of latent variables, leading to state space models. 
*** The two most important examples of state space models are the hidden Markov model, in which the latent variables are discrete, and linear dynamical systems, in which the latent variables are Gaussian.
*** Both models are described by directed graphs having a tree structure (no loops) for which inference can be performed efficiently using the sum-product algorithm.
** 13.1 Markov models
** 13.2 Hidden Markov models
*** 13.2.1 Maximum likelihood for the HMM
*** 13.2.2 The forward-backward algorithm
*** 13.2.3 The sum-product algorithm for the HMM
*** 13.2.4 Scaling factors
*** 13.2.5 The Viterbi algorithm
*** 13.2.6 Extensions of the hidden Markov model
** 13.3 Linear dynamical systems
*** 13.3.0 Introduction
**** We now consider extensions to other distributions for the latent variables. In particular, we consider continuous latent variables in which the summations of the sum-product algorithm become integrals. The general form of the inference algorithms will, however, be the same as for the hidden Markov model. ^^It is interesting to note that, historically, hidden Markov models and linear dynamical systems were developed independently. Once they are both expressed as graphical models, however, the deep relationship between them immediately becomes apparent.^^
**** Because the linear dynamical system is a linear-Gaussian model, the joint distribution over all variables, as well as all marginals and conditionals, will be Gaussian. It follows that ^^the sequence of individually most probable latent variable values is the same as the most probable latent sequence. There is thus no need to consider the analogue of the Viterbi algorithm for the linear dynamical system.^^
*** 13.3.1 Inference in LDS
*** 13.3.2 Learning in LDS
*** 13.3.3 Extensions of LDS
*** 13.3.4 Particle filters
* 14. Combining models
** 14.1 Bayesian model averaging
** 14.2 Committees
** 14.3 Boosting
*** 14.3.1 Minimizing exponential error
*** 14.3.2 Error functions for boosting
** 14.4 Tree-based models
** 14.5 Conditional mixture models
*** 14.5.1 Mixtures of linear regression models
*** 14.5.2 Mixtures of logistic models
*** 14.5.3 Mixtures of experts
