content/posts/Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006.md


### 9.4 The EM algorithm in general {#9-dot-4-the-em-algorithm-in-general}


## 10. Approximate inference {#10-dot-approximate-inference}


### 10.1 Variational inference {#10-dot-1-variational-inference}

<!--list-separator-->

-  10.1.1 Factorized distributions

<!--list-separator-->

-  10.1.2 Properties of factorized approximations

<!--list-separator-->

-  10.1.3 Example: the univariate Gaussian

<!--list-separator-->

-  10.1.4 Model comparison


### 10.2 Illustration: Variational mixture of Gaussians {#10-dot-2-illustration-variational-mixture-of-gaussians}

<!--list-separator-->

-  10.2.1 Variational distribution

<!--list-separator-->

-  10.2.2 Variational lower bound

<!--list-separator-->

-  10.2.3 Predictive density

<!--list-separator-->

-  10.2.4 Determining the number of components

<!--list-separator-->

-  10.2.5 Induced factorizations


### 10.3 Variational linear regression {#10-dot-3-variational-linear-regression}

<!--list-separator-->

-  10.3.1 Variational distribution

<!--list-separator-->

-  10.3.2 Predictive distribution

<!--list-separator-->

-  10.3.3 Lower bound


### 10.4 Exponential family distributions {#10-dot-4-exponential-family-distributions}

<!--list-separator-->

-  10.4.0 Introduction

    <!--list-separator-->

    -  Up to now we have grouped the variables in the model into ****observed variables**** and ****hidden variables****. We now make a further distinction between <span class="underline"><span class="underline">latent variables</span></span>, denoted \\[Z\\], and <span class="underline"><span class="underline">parameters</span></span>, denoted \\[\theta\\], where ****parameters**** are ****intensive**** ^^(fixed in number independent of the size of the data set)^^, whereas ****latent variables**** are ****extensive**** ^^(scale in number with the size of the data set)^^.

<!--list-separator-->

-  10.4.1 Variational message passing


### 10.5 Local variational methods {#10-dot-5-local-variational-methods}


### 10.6 Variational logistic regression {#10-dot-6-variational-logistic-regression}

<!--list-separator-->

-  10.6.1 Variational posterior distribution

<!--list-separator-->

-  10.6.2 Optimizing the variational parameters

<!--list-separator-->

-  10.6.3 Inference of hyperparameters


### 10.7 Expectation propagation {#10-dot-7-expectation-propagation}

<!--list-separator-->

-  10.7.1 Example: the clutter problem

<!--list-separator-->

-  10.7.2 Expectation propagation on graphs


## 11. Sampling methods {#11-dot-sampling-methods}


### 11.1 Basic sampling algorithms {#11-dot-1-basic-sampling-algorithms}

<!--list-separator-->

-  11.1.1 Standard distributions

<!--list-separator-->

-  11.1.2 Rejection sampling

<!--list-separator-->

-  11.1.3 Adaptive rejection sampling

<!--list-separator-->

-  11.1.4 Importance sampling

<!--list-separator-->

-  11.1.5 Sampling-importance-resampling

<!--list-separator-->

-  11.1.6 Sampling and the EM algorithm


### 11.2 Markov Chain Monte Carlo {#11-dot-2-markov-chain-monte-carlo}

<!--list-separator-->

-  11.2.1 Markov chains

<!--list-separator-->

-  11.2.2 The Metropolis-Hastings algorithm


### 11.3 Gibbs sampling {#11-dot-3-gibbs-sampling}


### 11.4 Slice sampling {#11-dot-4-slice-sampling}


### 11.5 The hybrid Monte Carlo algorithm {#11-dot-5-the-hybrid-monte-carlo-algorithm}

<!--list-separator-->

-  11.5.1 Dynamical systems

<!--list-separator-->

-  11.5.2 Hybrid Monte Carlo


### 11.6 Estimating the partition function {#11-dot-6-estimating-the-partition-function}


## 12. Continuous latent variables {#12-dot-continuous-latent-variables}


### 12.1 Principal component analysis {#12-dot-1-principal-component-analysis}

<!--list-separator-->

-  12.1.1 Maximum variance formulation

<!--list-separator-->

-  12.1.2 Minimum-error formulation

<!--list-separator-->

-  12.1.3 Applications of PCA

<!--list-separator-->

-  12.1.4 PCA for high-dimensional data


### 12.2 Probabilistic PCA {#12-dot-2-probabilistic-pca}

<!--list-separator-->

-  12.2.1 Maximum likelihood PCA

<!--list-separator-->

-  12.2.2 EM algorithm for PCA

<!--list-separator-->

-  12.2.3 Bayesian PCA

<!--list-separator-->

-  12.2.4 Factor analysis


### 12.3 Kernel PCA {#12-dot-3-kernel-pca}


### 12.4 Nonlinear latent variable models {#12-dot-4-nonlinear-latent-variable-models}

<!--list-separator-->

-  12.4.1 Independent component analysis

<!--list-separator-->

-  12.4.2 Autoassociative neural networks

<!--list-separator-->

-  12.4.3 Modelling nonlinear manifolds


## 13. Sequential data {#13-dot-sequential-data}


### 13.0 Introduction {#13-dot-0-introduction}

<!--list-separator-->

-  Although such models are tractable, they are also severely limited. We can obtain a more general framework, while still retaining tractability, by the introduction of latent variables, leading to state space models.

<!--list-separator-->

-  The two most important examples of state space models are the hidden Markov model, in which the latent variables are discrete, and linear dynamical systems, in which the latent variables are Gaussian.

<!--list-separator-->

-  Both models are described by directed graphs having a tree structure (no loops) for which inference can be performed efficiently using the sum-product algorithm.


### 13.1 Markov models {#13-dot-1-markov-models}


### 13.2 Hidden Markov models {#13-dot-2-hidden-markov-models}

<!--list-separator-->

-  13.2.1 Maximum likelihood for the HMM

<!--list-separator-->

-  13.2.2 The forward-backward algorithm

<!--list-separator-->

-  13.2.3 The sum-product algorithm for the HMM

<!--list-separator-->

-  13.2.4 Scaling factors

<!--list-separator-->

-  13.2.5 The Viterbi algorithm

<!--list-separator-->

-  13.2.6 Extensions of the hidden Markov model


### 13.3 Linear dynamical systems {#13-dot-3-linear-dynamical-systems}

<!--list-separator-->

-  13.3.0 Introduction

    <!--list-separator-->

    -  We now consider extensions to other distributions for the latent variables. In particular, we consider continuous latent variables in which the summations of the sum-product algorithm become integrals. The general form of the inference algorithms will, however, be the same as for the hidden Markov model. ^^It is interesting to note that, historically, hidden Markov models and linear dynamical systems were developed independently. Once they are both expressed as graphical models, however, the deep relationship between them immediately becomes apparent.^^

    <!--list-separator-->

    -  Because the linear dynamical system is a linear-Gaussian model, the joint distribution over all variables, as well as all marginals and conditionals, will be Gaussian. It follows that ^^the sequence of individually most probable latent variable values is the same as the most probable latent sequence. There is thus no need to consider the analogue of the Viterbi algorithm for the linear dynamical system.^^

<!--list-separator-->

-  13.3.1 Inference in LDS

<!--list-separator-->

-  13.3.2 Learning in LDS

<!--list-separator-->

-  13.3.3 Extensions of LDS

<!--list-separator-->

-  13.3.4 Particle filters


## 14. Combining models {#14-dot-combining-models}


### 14.1 Bayesian model averaging {#14-dot-1-bayesian-model-averaging}


### 14.2 Committees {#14-dot-2-committees}


### 14.3 Boosting {#14-dot-3-boosting}

<!--list-separator-->

-  14.3.1 Minimizing exponential error

<!--list-separator-->

-  14.3.2 Error functions for boosting


### 14.4 Tree-based models {#14-dot-4-tree-based-models}


### 14.5 Conditional mixture models {#14-dot-5-conditional-mixture-models}

<!--list-separator-->

-  14.5.1 Mixtures of linear regression models

<!--list-separator-->

-  14.5.2 Mixtures of logistic models

<!--list-separator-->

-  14.5.3 Mixtures of experts
